Конфигурация/InformationRegisters/РеквизитыСудебныхПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыСудебныхПроцессов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидУчастия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчастияВСудопроизводстве</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаИска</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СудебныйПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СудебныеПроцессы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВалютаИска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыСудебныхПроцессов/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	УниверсальныеМеханизмы.ЗаполнитьОрганизациюИзВедущегоИзмерения(ЭтотОбъект, "СудебныйПроцесс");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	КонтрольУникальностиВидаУчастияВОдинДень(Отказ);
	
КонецПроцедуры

Процедура КонтрольУникальностиВидаУчастияВОдинДень(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыСудебныхПроцессов.СудебныйПроцесс КАК СудебныйПроцесс,
		|	РеквизитыСудебныхПроцессов.Период КАК Период
		|ИЗ
		|	РегистрСведений.РеквизитыСудебныхПроцессов КАК РеквизитыСудебныхПроцессов
		|
		|СГРУППИРОВАТЬ ПО
		|	РеквизитыСудебныхПроцессов.Период,
		|	РеквизитыСудебныхПроцессов.СудебныйПроцесс
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеквизитыСудебныхПроцессов.ВидУчастия) > 1";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("В реквизитах судебного процесса %1 уставлены разные виды участия на %2",
				Выборка.СудебныйПроцесс,
				Формат(Выборка.Период, "ДФ=dd.MM.yy")), ЭтотОбъект, "ВидУчастия",, Отказ);
	КонецЦикла;
	
КонецПроцедуры
